## Домашнее Задание по Java


### Задание 1: Анализатор Текста
- Напишите программу, которая анализирует текст, введенный пользователем.
- Программа должна выводить количество символов(включая пробелы), количество букв (не включая пробелы)
- Также программа должна отобразить текст в обратном порядке (используйте `StringBuilder`).

### Задание 2: Форматирование Даты
- Напишите метод, который принимает строку в формате "гггг-мм-дд" (например, "2023-03-21") и возвращает ее в формате "дд.мм.гггг" (например, "21.03.2023").
- Используйте методы `substring()` и `concat()` для выполнения задачи.

### Исходный Код

```java
import java.util.Scanner;

public class StringHomework {

    public static void main(String[] args) {

        // Задача 1: Анализатор текста
        System.out.println("Введите текст для анализа:");
        String text = ...;
        analyzeText(text);

        // Задача 2: Форматирование даты
        System.out.println("Введите дату в формате гггг-мм-дд:");
        String date = ...;
        formatDate(date);
        
    }

    // Метод для анализа текста
    public static void analyzeText(String text) {
        // ваш код ниже:
    }

    // Метод для форматирования даты
    public static void formatDate(String date) {
        String formattedDate = date;
        //... 
        System.out.println("Отформатированная дата: " + formattedDate);
        
    }
}
```