package theory;

public class Task2 {
    // дан массив целых чисел, проверить, что все числа в это массиве идут по возрастанию
    // обязательнок решение при помощи циклов, альтернативное при помощи класса Arrays (подумать, что и как применить из этого класса)

    public static void main(String[] args) {
        int[] nums = {1, 2, 3}; // false


        // for-loop, проверяет, что предыдущй элемент меньше текущего, в случае, если это так, то продолжаем,
        // если нет - то останавливаем цикл и говорим, что массив не отсортирован.
        // Возможно понадобиться переменная boolean, которая будет характеризовать массив отсортирован/не отсортирован
    }
}
