## Домашнее Задание: Практика с Массивами в Java

**Цель Задания:** Улучшение понимания работы с одномерными массивами в Java, включая инициализацию, обработку и
использование встроенных методов класса `Arrays`.

### Задачи:

1. **Создание и Инициализация Массива:**
    - Создайте массив целых чисел размером 10 элементов.
    - Инициализируйте массив случайными числами от 1 до 100.

2. **Сортировка и Поиск:**
    - Используйте `Arrays.sort()` для сортировки массива.
    - Найдите максимальное и минимальное значения в массиве.

3. **Изменение и Вывод:**
    - Умножьте каждый элемент массива на число 2.
    - Выведите исходный и измененный массивы в консоль.

4. **Копирование и Сравнение:**
    - Создайте копию исходного массива используя `Arrays.copyOf()`.
    - Сравните исходный массив и его копию с помощью `Arrays.equals()` и выведите результат сравнения.

5. **Преобразование в Список:**
    - Преобразуйте массив в объект `List` с помощью `Arrays.asList()` и выведите его.

**Дополнительно:** Попробуйте реализовать собственный алгоритм сортировки (например, сортировку пузырьком) и сравните
его эффективность с `Arrays.sort()`.


## Домашнее Задание *: Анализ Качества Деталей на Заводе

**Цель Задания:** Развитие навыков обработки данных в массивах и выполнение статистических расчетов в Java.

### Задача:

**Контекст:** На заводе производятся детали, каждая из которых после изготовления оценивается и помещается в партию. Партия представлена массивом чисел, где:
- `-1` обозначает бракованную деталь,
- `0` - деталь, требующую доработки,
- `1` - идеальную деталь, готовую к эксплуатации.

**Задание:**
- Создайте массив целых чисел, который содержит случайное распределение значений `-1`, `0` и `1`, имитируя партию деталей с завода.
- Рассчитайте и выведите в консоль процентное соотношение каждого типа деталей в партии.

### Детали Реализации:

1. **Инициализация Массива:**
    - Массив должен быть инициализирован случайными числами `-1`, `0`, и `1`.
    - Размер массива можно задать произвольно или запросить у пользователя.

2. **Расчет Процентного Соотношения:**
    - Подсчитайте количество каждого типа деталей в массиве.
    - Рассчитайте процентное соотношение для каждого типа деталей от общего количества деталей в массиве.

3. **Вывод Результата:**
    - Выведите в консоль процентное соотношение бракованных, требующих доработки и идеальных деталей.

> Это задание позволит вам практиковаться в анализе данных и выполнении статистических расчетов, а также укрепить понимание работы с массивами в Java.

<details style="margin-left: 20px;">
<summary><strong><em> Пример решения (разверните данный блок, только если вы НЕ РЕШИЛИ самостоятельно): (нажмите на треугольник, чтобы развернуть текст)</em></strong></summary>

```java
import java.util.Random;

public class PartsQualityAnalysis {
    public static void main(String[] args) {
        // Создание и инициализация массива
        int[] parts = new int[100];
        Random random = new Random();
        for (int i = 0; i < parts.length; i++) {
            parts[i] = random.nextInt(3) - 1; // Генерация чисел -1, 0, 1
        }

        // Расчет процентного соотношения
        int countNegativeOne = 0;
        int countZero = 0;
        int countOne = 0;

        for (int part : parts) {
            if (part == -1) {
                countNegativeOne++;
            } else if (part == 0) {
                countZero++;
            } else if (part == 1) {
                countOne++;
            }
        }

        double ratioNegativeOne = (countNegativeOne / (double) parts.length) * 100;
        double ratioZero = (countZero / (double) parts.length) * 100;
        double ratioOne = (countOne / (double) parts.length) * 100;

        // Вывод результатов
        System.out.printf("Процент бракованных деталей: %.2f%%%n", ratioNegativeOne);
        System.out.printf("Процент деталей, требующих доработки: %.2f%%%n", ratioZero);
        System.out.printf("Процент идеальных деталей: %.2f%%%n", ratioOne);
    }
}
```
</details>