## Домашнее Задание: Интерактивный Ввод Данных

_задания помеченные * - усложненные задачи для тех, кому хотелось бы попрактиковаться в решении более сложных заданий_

## Задание 1. для Практики Циклов for в Java

**Цель задания:** Написать программу на Java, использующую цикл `for` для решения конкретной задачи.

### Задача: Генерация Таблицы Умножения

**Описание задачи:**
Написать программу, которая генерирует и выводит таблицу умножения от 1 до 10. Для каждого числа от 1 до 10,
таблица должна показывать произведение этого числа на числа от 1 до 10.

**Требования к реализации:**
Использовать вложенные циклы `for`. Внешний цикл должен итерироваться по одному множителю (например, от 1 до 10),
а внутренний цикл - по другому множителю.

**Ожидаемый результат:**
Программа должна выводить таблицу умножения от 1 до 10. Каждая строка таблицы представляет собой произведение
одного числа на числа от 1 до 10.

```markdown
    1 * 1 = 1
    1 * 2 = 2
    1 * 3 = 3
    ...
    1 * 10 = 10

    2 * 1 = 2
    2 * 2 = 4
    2 * 3 = 6
    ...
    2 * 10 = 20

    ...
    
    10 * 1 = 10
    10 * 2 = 20
    10 * 3 = 30
    ...
    10 * 10 = 100
```

### Дополнительное задание (необязательно):

Попробуйте модифицировать программу так, чтобы она принимала ввод от пользователя для определения диапазона чисел таблицы 
умножения (например, от 2 до 5).

Это задание поможет улучшить понимание работы циклов `for` и их использования для решения практических задач.


## Задание 2*.  для Практики Циклов for в Java

**Цель задания:** Разработать программу на Java, которая использует цикл `for` для решения задачи.

### Задача: Поиск Простых Чисел

**Описание задачи:**
Написать программу, которая находит и выводит все простые числа в заданном диапазоне (например, от 2 до N).
Простое число - это число, которое делится без остатка только на себя и на 1 (2 - простое число).


> <details style="margin-left: 20px;">
> <summary><strong><em> Подсказка к решению: (нажмите на треугольник, чтобы развернуть текст)</em></strong></summary>
>
> **Требования к реализации:**
> Использовать цикл `for` для перебора чисел в заданном диапазоне. Внутри цикла использовать другой цикл `for`
> для проверки, является ли число простым (подсказка: число не должно делиться нацело на любое другое число, кроме себя и 1).
> 
> 
> <details style="margin-left: 20px;">
> <summary><strong><em> Решение (откройте только если не решили самостоятельно): </em></strong></summary>
>
> ```java
> for (int i = 2; i <= 100; i++) {
>    // Предполагаем, что текущее число (i) является простым
>    boolean isPrime = true;
>    
>    // Проверяем, делится ли число на какое-либо другое число кроме 1 и самого себя.
>    // Для этого достаточно проверить делители до i/2, поскольку большие числа не могут быть делителями.
>    for (int j = 2; j <= i / 2; j++) {
>        // Если число делится без остатка, оно не является простым.
>        if (i % j == 0) {
>        isPrime = false; // Указываем, что число не простое
>        break; // Прерываем внутренний цикл, так как уже нашли делитель.
>        }
>    }
>    
>    // Если после проверки всех возможных делителей число осталось простым, выводим его.
>    if (isPrime) {
>        System.out.println(i + " - простое число");
>    }
>}
>```
> </details>
> </details>

**Ожидаемый результат:**
Программа должна выводить список всех простых чисел в заданном диапазоне.

```markdown
2 - простое число
3 - простое число
5 - простое число
7 - простое число
11 - простое число
13 - простое число
17 - простое число
19 - простое число
23 - простое число
...
```

### Дополнительное задание (необязательно):

Модифицируйте программу так, чтобы пользователь мог ввести свой диапазон для поиска простых чисел (например, от 20 до 50).

Это задание поможет развить понимание работы циклов `for` и их использования для решения более сложных задач.
